Дошкольное_учреждение83/src/Catalogs/удуГруппыУчреждения/удуГруппыУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуГруппыУчреждения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Вместительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсирующаяНаправленность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезОграниченияВместительности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленностьГруппы</name>
    <type>
      <types>EnumRef.удуТипыНаправленностиГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияНаправленности</name>
    <type>
      <types>CatalogRef.удуДетализацияНаправленностиГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.удуВозрастныеПризнаки</types>
    </type>
  </attributes>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВоспитательныйПерсонал</name>
    <attributes>
      <name>РаботникУчреждения</name>
      <type>
        <types>CatalogRef.удуСотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/InformationRegisters/удуСведенияОЗачисленииРебенкаВГруппу/удуСведенияОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСведенияОЗачисленииРебенкаВГруппу</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОснованиеЗачисления</name>
    <type>
      <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеУчетаВГруппе</name>
    <type>
      <types>EnumRef.удуСостояниеРебенкаНаУчетеВГруппе</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаВыбытияИзГруппы</name>
    <type>
      <types>CatalogRef.удуПричиныВыбытияИзГруппы</types>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуСостояниеРебенкаНаУчетеВГруппе/удуСостояниеРебенкаНаУчетеВГруппе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСостояниеРебенкаНаУчетеВГруппе</name>
  <enumValues>
    <name>ПринятВГруппу</name>
  </enumValues>
  <enumValues>
    <name>ИсключенИзГруппы</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Documents/удуПриказОЗачисленииРебенкаВГруппу/удуПриказОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуПриказОЗачисленииРебенкаВГруппу</name>
  <registerRecords>InformationRegister.удуСведенияОЗачисленииРебенкаВГруппу</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольВместимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКомплектация</name>
    <type>
      <types>DocumentRef.удуКомплектованиеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьЗачисление</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеЗачисления</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Catalogs/удуДети/удуДети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуДети</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтатусРебенка</name>
    <type>
      <types>EnumRef.удуСтатусРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.удуПол</types>
    </type>
  </attributes>
  <attributes>
    <name>Национальность</name>
    <type>
      <types>CatalogRef.удуНациональности</types>
    </type>
  </attributes>
  <attributes>
    <name>РоднойЯзык</name>
    <type>
      <types>CatalogRef.удуЯзыкиНародовМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиСвидетельства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдачиСвидетельства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаРождения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаПроживания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоциальноеПоложение</name>
    <type>
      <types>CatalogRef.удуСоциальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖилищныеУсловия</name>
    <type>
      <types>CatalogRef.удуЖилищныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериальноеПоложение</name>
    <type>
      <types>CatalogRef.удуМатериальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСоциальныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотографияРебенка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/удуГруппыУчреждения/Forms/ФормаНастройкиПечати/Module.bsl
&НаСервере
Функция СформироватьПечатнуюФормуСпискаДетей()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.Ссылка,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.Наименование КАК Наименование,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.Пол КАК Пол,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.Национальность КАК Национальность,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.РоднойЯзык КАК РоднойЯзык,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.ДатаРождения КАК ДатаРождения,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.СерияСвидетельства КАК СерияСвидетельства,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.НомерСвидетельства КАК НомерСвидетельства,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.ДатаВыдачиСвидетельства КАК ДатаВыдачиСвидетельства,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.СоциальноеПоложение КАК СоциальноеПоложение,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.ЖилищныеУсловия КАК ЖилищныеУсловия,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Ребенок.МатериальноеПоложение КАК МатериальноеПоложение,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Регистратор.Ссылка,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Регистратор.Номер,
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Регистратор.Дата,
	               |	ВЫБОР
	               |		КОГДА удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.Регистратор.Ссылка ССЫЛКА Документ.удуПриказОЗачисленииРебенкаВГруппу
	               |			ТОГДА ""Приказ о зачислении №""
	               |		ИНАЧЕ ""Приказ о переводе № ""
	               |	КОНЕЦ КАК РегистраторВид
	               |ИЗ
	               |	РегистрСведений.удуСведенияОЗачисленииРебенкаВГруппу.СрезПоследних(&ДатаОтчета, Группа = &Группа) КАК удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних
	               |ГДЕ
	               |	удуСведенияОЗачисленииРебенкаВГруппуСрезПоследних.СостояниеУчетаВГруппе = &СостояниеУчетаВГруппе
	               |АВТОУПОРЯДОЧИВАНИЕ";				   
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаПечатиСписка));
	Запрос.УстановитьПараметр("Группа", ПараметрГруппа);
	Запрос.УстановитьПараметр("СостояниеУчетаВГруппе", Перечисления.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = ПараметрГруппа.ПолучитьОбъект().ПолучитьМакет("Макет");
	
	СекцияШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
	СекцияШапка.Параметры.НаименованиеГруппы = СокрЛП(ПараметрГруппа.Наименование);
	СекцияШапка.Параметры.ДатаФормирования = Формат(ДатаПечатиСписка, "ДЛФ=D");
	ТабличныйДокумент.Вывести(СекцияШапка);
	
	// динамически формируем шапку отчета
	Для Каждого СтрокаНастройкиОтчета Из СписокПечатаемыхРеквизитов Цикл
		Если СтрокаНастройкиОтчета.Использование Тогда
			Если СтрокаНастройкиОтчета.НаименованиеРеквизита <> "Наименование" Тогда
				СекцияШапкаРеквизит = Макет.ПолучитьОбласть("Шапка|" + СокрЛП(СтрокаНастройкиОтчета.НаименованиеРеквизита));
				ТабличныйДокумент.Присоединить(СекцияШапкаРеквизит);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	НПП = 0;
	Для Каждого СтрокаРезультатЗапроса Из РезультатЗапроса Цикл
		НПП = НПП + 1;
		СекцияСтрока = Макет.ПолучитьОбласть("Строка|Наименование");
		СекцияСтрока.Параметры.НПП = НПП;
		СекцияСтрока.Параметры.Заполнить(СтрокаРезультатЗапроса);
		ТабличныйДокумент.Вывести(СекцияСтрока);
		
		// динамически формируем строки отчета
		Для Каждого СтрокаНастройкиОтчета Из СписокПечатаемыхРеквизитов Цикл
			Если СтрокаНастройкиОтчета.Использование Тогда
				Если СтрокаНастройкиОтчета.НаименованиеРеквизита = "АдресМестаРождения" Тогда
					СекцияСтрокаРеквизит = Макет.ПолучитьОбласть("Строка|АдресМестаРождения");
					НайденнаяСтрокаМестаРождения = СтрокаРезультатЗапроса.РебенокСсылка.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.АдресМестаРожденияРебенка);
					Если НайденнаяСтрокаМестаРождения <> Неопределено Тогда
						СекцияСтрокаРеквизит.Параметры.ПараметрАдресРождения = СокрЛП(НайденнаяСтрокаМестаРождения.Представление);
					Иначе
						СекцияСтрокаРеквизит.Параметры.ПараметрАдресРождения = "";
					КонецЕсли;
					ТабличныйДокумент.Присоединить(СекцияСтрокаРеквизит);
				ИначеЕсли СтрокаНастройкиОтчета.НаименованиеРеквизита = "АдресМестаПроживания" Тогда
					СекцияСтрокаРеквизит = Макет.ПолучитьОбласть("Строка|АдресМестаПроживания");
					НайденнаяСтрокаМестаПроживания = СтрокаРезультатЗапроса.РебенокСсылка.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияРебенка);
					Если НайденнаяСтрокаМестаПроживания <> Неопределено Тогда
						СекцияСтрокаРеквизит.Параметры.ПараметрАдресПроживания = СокрЛП(НайденнаяСтрокаМестаПроживания.Представление);
					Иначе
						СекцияСтрокаРеквизит.Параметры.ПараметрАдресПроживания = "";
					КонецЕсли;
					ТабличныйДокумент.Присоединить(СекцияСтрокаРеквизит);
				ИначеЕсли СтрокаНастройкиОтчета.НаименованиеРеквизита = "Регистратор" Тогда
					СекцияСтрокаРеквизит = Макет.ПолучитьОбласть("Строка|Регистратор");
					СекцияСтрокаРеквизит.Параметры.РегистраторВид = СтрокаРезультатЗапроса.РегистраторВид + удуФормированиеПечатныхФорм.ПолучитьНомерНаПечать(СтрокаРезультатЗапроса.РегистраторНомер);
					СекцияСтрокаРеквизит.Параметры.РегистраторДата = СтрокаРезультатЗапроса.Регистратордата;
					СекцияСтрокаРеквизит.Параметры.РегистраторСсылка = СтрокаРезультатЗапроса.РегистраторСсылка;
					ТабличныйДокумент.Присоединить(СекцияСтрокаРеквизит);						
				Иначе
					СекцияСтрокаРеквизит = Макет.ПолучитьОбласть("Строка|" + СокрЛП(СтрокаНастройкиОтчета.НаименованиеРеквизита));
					СекцияСтрокаРеквизит.Параметры.Заполнить(СтрокаРезультатЗапроса);
					ТабличныйДокумент.Присоединить(СекцияСтрокаРеквизит);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	// Заполним список печатаемых реквизитов	
	Для Каждого РеквизитСправочникаДети Из Справочники.удуДети.ПустаяСсылка().Метаданные().Реквизиты Цикл
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "СтатусРебенка" Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "Фамилия" Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "Имя" Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "Отчество" Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "ФотографияРебенка" Тогда
			Продолжить;
		КонецЕсли;		
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "СерияСвидетельства" Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "НомерСвидетельства" Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "ДатаВыдачиСвидетельства" Тогда
			Продолжить;
		КонецЕсли;				
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "ОрганВыдачиСвидетельства" Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(РеквизитСправочникаДети.Имя) = "ДополнительныеСоциальныеСведения" Тогда
			Продолжить;
		КонецЕсли;				
		Если (СокрЛП(РеквизитСправочникаДети.Имя) = "Национальность") И (НЕ Константы.удуИспользоватьПерсональныеДанные.Получить()) Тогда
			Продолжить;
		КонецЕсли;				
		Если (СокрЛП(РеквизитСправочникаДети.Имя) = "СоциальноеПоложение") И (НЕ Константы.удуИспользоватьПерсональныеДанные.Получить()) Тогда
			Продолжить;
		КонецЕсли;				
		Если (СокрЛП(РеквизитСправочникаДети.Имя) = "МатериальноеПоложение") И (НЕ Константы.удуИспользоватьПерсональныеДанные.Получить()) Тогда
			Продолжить;
		КонецЕсли;				
		
		НоваяСтрокаСписка = СписокПечатаемыхРеквизитов.Добавить();
		НоваяСтрокаСписка.Использование = Истина;
		НоваяСтрокаСписка.НаименованиеРеквизита = СокрЛП(РеквизитСправочникаДети.Имя);
		НоваяСтрокаСписка.СинонимРеквизита = СокрЛП(РеквизитСправочникаДети.Синоним);		
	КонецЦикла;	
	
	НоваяСтрокаСписка = СписокПечатаемыхРеквизитов.Добавить();
	НоваяСтрокаСписка.Использование = Истина;
	НоваяСтрокаСписка.НаименованиеРеквизита = "СвидетельствоОРождении";	
	НоваяСтрокаСписка.СинонимРеквизита = "Сведения свидетельства о рождении";	
	
	НоваяСтрокаСписка = СписокПечатаемыхРеквизитов.Добавить();
	НоваяСтрокаСписка.Использование = Истина;
	НоваяСтрокаСписка.НаименованиеРеквизита = "Регистратор";	
	НоваяСтрокаСписка.СинонимРеквизита = "Сведения о зачислении/переводе в группу";	
	
	ДатаПечатиСписка = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьСписка(Команда)
	// Вставить содержимое обработчика.
	ТабличныйДокумент = СформироватьПечатнуюФормуСпискаДетей();
	
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ФиксацияСлева = 2;	
	ТабличныйДокумент.Показать();	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтметитьВсе(Команда)
	// Вставить содержимое обработчика.
	Для Каждого СтрокаРеквизита Из СписокПечатаемыхРеквизитов Цикл
		СтрокаРеквизита.Использование = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	// Вставить содержимое обработчика.
	Для Каждого СтрокаРеквизита Из СписокПечатаемыхРеквизитов Цикл
		СтрокаРеквизита.Использование = Ложь;
	КонецЦикла;	
КонецПроцедуры
